# Задание 5 Реализуйте алгоритм перемешивания списка.

import random

mylist = [2, 5, 8, 9, 3, 7]
print(random.sample(mylist, k=6))

# original_list = [input('Введите список: ')]
# new_list = []
# for i in original_list:
#    i = random.randrange(len(original_list))
#    new_list += i
# print(new_list)
