# Задание 6 Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
# Пример - Для "abababb" и "aba" -> 2

S1 = str(input('Введите первую строку: '))
S2 = str(input('Введите вторую строку: '))
print(S1.count(S2))

